Enums/ЛБ_УстановкаЗначенияИлиОтклонения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_УстановкаЗначенияИлиОтклонения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ОтклонениеОтБазовойЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ОтклонениеОтБазовойЦены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Относительное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Абсолютное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ПричиныПримененияПроцентнойСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ПричиныПримененияПроцентнойСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ЗаполнениеПроцентныхСтавокАкцияИзПриказа/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Приказ = Параметры.Документ.Ссылка;  
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Приказ) Тогда 
		Сообщить("Не выбран приказ!");
		Возврат;
	КонецЕсли;     
	Если Параметры.ТолькоПросмотр = истина Тогда
		Элементы.СохранитьИзменения.Доступность = ложь;
		Элементы.ТаблицаС.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	ТаблицаСтавок.Загрузить(Приказ.УсловияАкцииСтавки.Выгрузить());	
	ЗаполнитьТаблицыИзПриказа(); 
	
	Если ДиапазоныСК.Количество() = 0 Тогда 
		ОсновнойДиапазон = Константы.ЛБ_ОсновнойДиапазонСуммЗайма.Получить();
		Если ЗначениеЗаполнено(ОсновнойДиапазон) Тогда
			Выборка = Справочники.ЛБ_ДиапазоныСуммЗайма.ВыбратьИерархически(ОсновнойДиапазон,,,"ПорядокСортировки");
			КлючСтроки = 0;
			Пока Выборка.Следующий() Цикл 
				КлючСтроки = КлючСтроки + 1;
				НоваяСтрД = ДиапазоныСК.Добавить(); 
				НоваяСтрД.КлючСтроки = КлючСтроки; 
				НоваяСтрД.ДиапазонСумм = Выборка.Ссылка;
			Конеццикла;	    
			
			Для каждого СтрД Из ДиапазоныСК Цикл
			    ДобавитьКолонкуДоп(СтрД.КлючСтроки, СтрД.ДиапазонСумм);
			КонецЦикла;   
		Иначе   
			Сообщить("Не установлен основной диапазон сумм займа!");
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыИзПриказа() 		
	ДиапазоныДоп = ТаблицаСтавок.Выгрузить(, "ДиапазонСумм");
	ДиапазоныДоп.Свернуть("ДиапазонСумм");   
	
	КлючСтроки = 0; 
	ДиапазоныСК.Очистить();
	Для каждого СтрД Из ДиапазоныДоп Цикл 
		КлючСтроки = КлючСтроки + 1;
		НоваяСтрД = ДиапазоныСК.Добавить(); 
		НоваяСтрД.КлючСтроки = КлючСтроки; 
		НоваяСтрД.ДиапазонСумм = СтрД.ДиапазонСумм;
	КонецЦикла;
	
	Для каждого СтрД Из ДиапазоныСК Цикл
	    ДобавитьКолонкуДоп(СтрД.КлючСтроки, СтрД.ДиапазонСумм);
	КонецЦикла;   
	
	ТаблицаСтавокДоп = ТаблицаСтавок.Выгрузить();
	ТаблицаСтавокДоп.Свернуть("СхемаКредитования, ПричинаПрименения, СтатусЗалогодателя, УстановитьЗначениеИлиОтклонение, Отклонение");
	
	ТаблицаС.Очистить();
	Для каждого Стр Из ТаблицаСтавокДоп Цикл
		НоваяСтр = ТаблицаС.Добавить();		 
		НоваяСтр.СхемаКредитования = Стр.СхемаКредитования; 
		НоваяСтр.ПричинаПрименения = Стр.ПричинаПрименения;
		НоваяСтр.СтатусЗалогодателя = Стр.СтатусЗалогодателя;   
		НоваяСтр.УстановитьЗначениеИлиОтклонение = Стр.УстановитьЗначениеИлиОтклонение;
		НоваяСтр.Отклонение = Стр.Отклонение;
		
		ОтборД = Новый Структура;
		ОтборД.Вставить("СхемаКредитования", Стр.СхемаКредитования);
		ОтборД.Вставить("ПричинаПрименения", Стр.ПричинаПрименения);
		ОтборД.Вставить("СтатусЗалогодателя", Стр.СтатусЗалогодателя); 
		ОтборД.Вставить("УстановитьЗначениеИлиОтклонение", Стр.УстановитьЗначениеИлиОтклонение); 
		ОтборД.Вставить("Отклонение", Стр.Отклонение);
		Для каждого СтрД Из ДиапазоныСК Цикл
			ОтборД.Вставить("ДиапазонСумм", СтрД.ДиапазонСумм);
			СтрокиСК = ТаблицаСтавок.НайтиСтроки(ОтборД);
			Если НЕ СтрокиСК.Количество() = 0 Тогда 
				СтрК = СтрокиСК.Получить(0);  
				Если Стр.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение Тогда
			        НоваяСтр["Диапазон_" + Строка(СтрД.КлючСтроки)] = СтрК.Ставка; 
				Иначе	
					НоваяСтр["Диапазон_" + Строка(СтрД.КлючСтроки)] = СтрК.ЗначениеОтклонения;  
				КонецЕсли;	
			КонецЕсли;	
	    Конеццикла;
	Конеццикла;	
КонецПроцедуры   

&НаСервере
Процедура ДобавитьКолонкуДоп(КлючСтроки, Диапазон)
	МассивДобавляемыхРеквизитов = Новый Массив; 
	СписокТипов = Новый Массив;
    СписокТипов.Добавить(Тип("Число"));
    ОписаниеСоставногоТипа = Новый ОписаниеТипов(СписокТипов,,,Новый КвалификаторыЧисла(15,3));
	НовыйРеквизит = Новый РеквизитФормы("Диапазон_" + СокрЛП(КлючСтроки), ОписаниеСоставногоТипа, "ТаблицаС");
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	 
	ПолеВвода = Элементы.Добавить(
		"Диапазон_" + СокрЛП(КлючСтроки),    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		Элементы.ТаблицаС); //Контейнер для поля ввода (Форма,Группа,Страница)
		
	ПолеВвода.Заголовок = СокрЛП(Диапазон);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "ТаблицаС.Диапазон_" + СокрЛП(КлючСтроки); 
	ПолеВвода.ВыбиратьТип = Ложь;
	ПолеВвода.КнопкаСоздания = Ложь;
	ПолеВвода.КнопкаОткрытия = Ложь;
КонецПроцедуры	

&НаСервере
Функция ПроверитьПСК()
	ПСКДень = 0; 
	ВсеОК = Истина;
    СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(Приказ.Дата, Константы.ЛБ_ОсновнаяОрганизация.Получить());  
	Если НЕ СтруктураП = неопределено Тогда		
	    ПСКДень = окр(СтруктураП.ПСКГод/365, 3); 
	КонецЕсли;  
	Если НЕ ПСКДень = 0 Тогда
		Для каждого Стр Из ТаблицаСтавок Цикл 
			Если Стр.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение Тогда
				Если Стр.Ставка > ПСКДень Тогда 
					ВсеОК = ложь;
					Сообщить(СокрЛП(Стр.ПричинаПрименения) + " " + СокрЛП(Стр.СхемаКредитования) + ", статус клиента " + ?(ЗначениеЗаполнено(Стр.статусЗалогодателя),СокрЛП((Стр.статусЗалогодателя)), "любой") +
					         ": процентная ставка по акции в диапазоне " + СокрЛП(Стр.ДиапазонСумм) + " превышает предельный размер ставки кредитования в день.");
				КонецЕсли;
			КонецЕсли;	
		Конеццикла;	                                         
	КонецЕсли;
	Если ВсеОК Тогда 
		Возврат Истина;
	Иначе   
		Возврат ложь;
	КонецЕсли;	
КонецФункции	


&НаКлиенте
Процедура СохранитьИзменения(Команда) 
	СохранитьИзмененияСтавокСФормы();
	Если ПроверитьПСК() Тогда
		СохранитьПриказ();
		ЭтаФорма.Закрыть(Истина);  
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СохранитьПриказ()
	ДокументОбъект = Приказ.ПолучитьОбъект();
	ДокументОбъект.УсловияАкцииСтавки.Загрузить(ТаблицаСтавок.Выгрузить());
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияСтавокСФормы() 
	ТаблицаСтавок.Очистить();
	Для каждого Стр Из ТаблицаС Цикл  
		Для каждого СтрД Из ДиапазоныСК Цикл
			СтрС = ТаблицаСтавок.Добавить();  
			СтрС.СхемаКредитования = Стр.СхемаКредитования;
			СтрС.ПричинаПрименения = Стр.ПричинаПрименения;
			СтрС.СтатусЗалогодателя = Стр.СтатусЗалогодателя;
			СтрС.УстановитьЗначениеИлиОтклонение = Стр.УстановитьЗначениеИлиОтклонение;
			СтрС.Отклонение = Стр.Отклонение; 
			СтрС.ДиапазонСумм = СтрД.ДиапазонСумм;
			КлючСтроки = СтрД.КлючСтроки;  
			Если Стр.УстановитьЗначениеИлиОтклонение = Перечисления.ЛБ_УстановкаЗначенияИлиОтклонения.Значение Тогда
			    СтрС.Ставка = Стр["Диапазон_" + Строка(КлючСтроки)];  
			Иначе	  
				СтрС.ЗначениеОтклонения = Стр["Диапазон_" + Строка(КлючСтроки)];
			КонецЕсли;	
        КонецЦикла;
	Конеццикла;	
КонецПроцедуры	


&НаКлиенте
Процедура ТаблицаСКУстановитьЗначениеИлиОтконениеПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаС.ТекущиеДанные;     
	Если НЕ ТекущаяУстановка = ТекСтрока.УстановитьЗначениеИлиОтклонение Тогда
		ТекущаяУстановка = ТекСтрока.УстановитьЗначениеИлиОтклонение;
	    Если ТекСтрока.УстановитьЗначениеИлиОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение") Тогда
		    ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка");
		Иначе 
			ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.Абсолютное");
		КонецЕсли;  
		Для каждого СтрД Из ДиапазоныСК Цикл
			КлючСтроки = СтрД.КлючСтроки; 
			ТекСтрока["Диапазон_" + Строка(КлючСтроки)] = 0;
		КонецЦикла;	  		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСПриАктивизацииСтроки(Элемент) 
	ТекСтрока = Элементы.ТаблицаС.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
	    ТекущаяУстановка = ТекСтрока.УстановитьЗначениеИлиОтклонение;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.ТаблицаС.ТекущиеДанные;  
	Если НоваяСтрока И Не Копирование Тогда
		ТекСтрока.ПричинаПрименения = ПредопределенноеЗначение("Перечисление.ЛБ_ПричиныПримененияПроцентнойСхемы.ВыдачаЗайма"); 
		ТекСтрока.УстановитьЗначениеИлиОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение");  
		
		Для каждого СтрД Из ДиапазоныСК Цикл
			КлючСтроки = СтрД.КлючСтроки; 
			ТекСтрока["Диапазон_" + Строка(КлючСтроки)] = 0;
		КонецЦикла;	 
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтрока = Элементы.ТаблицаС.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекСтрока.СхемаКредитования) Тогда   
		ТекСтрока.УстановитьЗначениеИлиОтклонение = ПредопределенноеЗначение("Перечисление.ЛБ_УстановкаЗначенияИлиОтклонения.Значение");
		ТекСтрока.Отклонение = ПредопределенноеЗначение("Перечисление.ЛБ_ОтклонениеОтБазовойЦены.ПустаяСсылка"); 
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаСПередУдалением(Элемент, Отказ)
	ТекСтрока = Элементы.ТаблицаС.ТекущиеДанные;

	Отбор = Новый Структура;
	Отбор.Вставить("СхемаКредитования", ТекСтрока.СхемаКредитования);
	Отбор.Вставить("ПричинаПрименения", ТекСтрока.ПричинаПрименения);
	Отбор.Вставить("СтатусЗалогодателя", ТекСтрока.СтатусЗалогодателя);
	
	СтрокиС = ТаблицаСтавок.НайтиСтроки(Отбор);
	Если  НЕ СтрокиС.Количество() = 0 Тогда
		Для каждого Стрс из СтрокиС цикл
		    ТаблицаСтавок.Удалить(СтрС);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
